<template>
  <body>
    <section class="news">
      <div class="wrapper">

        <div v-show="currentNews === 'news3Info'" class="news3Info">
          <h3 class="fs-48px">Самый важный аксессуар в автомобиле</h3>
          <h4 class="fs-17px fw-400 lh-2">
            Вам не нужно тратить целое состояние на установку послепродажного обслуживания, чтобы обновить удобства вашего автомобиля.
            Мы выбрали лучшее предложение по снаряжению для более безопасных, умных и чистых поездок на работу.<br><br>

            Над рекой и через лес было опаснее, когда автомобили имели мягкие шины с наклонным слоем, задний привод и обычные тормоза.
            Итак, сегодня вечером вы чувствуете себя уверенно, возвращаясь домой через несколько дюймов свежевыпавшего снега после роскошного праздничного ужина.
            Ваш переднеприводный автомобиль имеет отличные всесезонные шины и ABS (антиблокировочную тормозную систему), хотя свет ABS горит с тех пор, как час назад вы взяли берму в конце подъездной дороги.
            Это может объяснить потерю рулевого управления, когда вы замедляетесь на повороте. Как этот спуск-поворот, направо... там, когда вы проезжаете прямо мимо него с заносом колес и рулевым управлением, сильно переворачивающимся против своей оси.<br><br>

            ABS стала в значительной степени стандартным оборудованием на большинстве автомобилей.
            Датчики сообщают компьютеру, когда колесо перестает вращаться, что указывает — по крайней мере, когда транспортное средство все еще имеет скорость вперед — что тормоза преодолели доступную тягу на этом конкретном колесе.
            Затем компьютер направляет гидравлический клапан, чтобы выпустить некоторое давление тормозной жидкости на колесо, чтобы оно снова вращалось. <br><br>

            Этот процесс повторяется много раз в секунду, пока автомобиль не остановится или вы не поднимете ногу с педали тормоза.
            Компьютер ABS выполняет самотестирование при включении питания каждый раз, когда вы включаете зажигание.
            Если он обнаруживает, что ему не хватает данных, или гидравлический насос или клапан не реагируют, он загорается предупреждающей лампой ABS на приборной панели.
          </h4>
        </div>

        <div v-show="currentNews === 'news4Info'" class="news4Info">
          <h3 class="fs-48px">Лучшие внедорожники до миллиона рублей - выборка</h3>
          <h4 class="fs-17px fw-400 lh-2">
            Сегодня полный или полный привод доступен почти в каждом сегменте автомобилей, от компактных седанов до больших, чудовищных грузовиков 8.0L и даже некоторых хэтчбеков!
            Тем не менее,разница между полноприводными и полноприводными автомобилямизаключается в том, что полный привод больше фокусируется на удержании автомобиля на асфальте независимо от условий.
            Бездорожье, с другой стороны, это совершенно другая игра в мяч, которая требует трансмиссии 4x4, больших, мощных шин и высокого дорожного просвета, который заставит любую местность склониться перед вашим внедорожником.<br><br>

            К счастью, 4x4 также являются одними из лучших автомобилей, которые можно получить для себя на рынке подержанных автомобилей, поскольку они всегда были созданы, чтобы прослужить с самого начала и продолжать служить этой цели.
            Таким образом, если это внедорожная местность, которую вы хотите исследовать, без помех из-за ограничений асфальта, вам не нужно приобретать новейшую игрушку 4x4 на блоке, потому что неглупый, мощный автомобиль 4WD всегда находится прямо за углом, когда вы смотрите на подержанные.
            Вот лучшие внедорожники,которые вы можете привезти домой, не потратив ни копейки более 1.000.000 рублей.<br><br>
          </h4>

          <h4 class="fs-32px">Jeep Wrangler, 2010</h4>
          <img src="../assets/img/jeep-wrangler.png" loading="lazy" alt="Нет">
          <h4 class="fs-17px fw-400 lh-2">Король немощеной Америки, Wrangler 2010 года достаточно, чтобы дать любому энтузиасту почувствовать вкус квинтэссенции Jeep на трассах, гравии и скалистой, грязной местности.
            С 2009 по 2011 год существует множество вариантов покупки Wrangler под отметкой в 1.000.000 рублей.</h4>

          <h4 class="fs-32px">Mitsubishi Pajero, 1994</h4>
          <img src="../assets/img/mitsubishi-pajero.png" loading="lazy" alt="Нет">
          <h4 class="fs-17px fw-400 lh-2">Mitsubishi Pajero второго поколенияостается в сердцах энтузиастов как классика, а также раллийный 4x4.
            Автомобиль доказал свою ценность как прочный и надежный внедорожник, а ухоженный Pajero должен стоить вам около 1.000.000 рублей.</h4>

          <h4 class="fs-32px">Toyota Land Cruiser, 2014</h4>
          <img src="../assets/img/toyota-land-cruiser.png" loading="lazy" alt="Нет">
          <h4 class="fs-17px fw-400 lh-2">Как Land Cruiser мог не быть в этом списке? Независимо от поколения, чрезвычайно мощный и способный внедорожник Toyota всегда был зверем с дороги, и менее чем за 1.000.000 рублей есть некоторые варианты,
            доступныедля тех, кто хочет привезти японский внедорожник в свой гараж.</h4>

        </div>

          <h2 class="d-f f-d-c a-i-c fs-48px">Новости</h2>
          <h2 class="fs-48px">Популярное</h2>
          <div class="d-f f-d-r">
            <div class="news1">
              <div class="news1Info c-w">
                <h2 class="fs-24px fw-400">Мы открыты! <br> Добро пожаловать!</h2>
                <h4 class="fs-17px fw-400">02.11.22</h4>
              </div>
            </div>
            <div class="news2 ml-2">
              <div class="news1Info c-w">
                <h2 class="fs-24px fw-400">Где арендовать авто? Лучший сервис аренды автомобилей</h2>
                <h4 class="fs-17px fw-400">02.11.22</h4>
              </div>
            </div>

          </div>
        <h2 class="fs-48px">Последние новости</h2>

        <div class="news3 d-f">
          <img src="../assets/img/news-image-3.png" alt="Нет">
          <div class="d-f f-d-c">
            <h3 class="news3Title fs-28px fw-400">Самый важный аксессуар в автомобиле</h3>
            <div class="d-f f-d-r j-c-s-b mt_1 ml-2">
              <h4 class="fs-17px fw-400 c-black">Авто</h4>
              <h4 class="fs-17px fw-400 c-black">Обзоры</h4>
              <h4 class="fs-17px fw-400 c-black">04.11.22</h4>
            </div>
            <h3 class="fs-17px fw-400 ml-2 lh-2">Вам не нужно тратить целое состояние на установку послепродажного оборудования.
              В данной статье мы рассмотрели аксессуар, без которого езда невозможна</h3>
            <button @click="showNews('news3Info', 'checkNews3')" :disabled="currentNews === 'news3Info'" class="fs-24px fw-400 checkNews3" type="submit">{{ buttonText('checkNews3') }}</button>
          </div>


        </div>

        <div class="news4 d-f mt_3 mb_2">
          <img src="../assets/img/news-image-4.png" alt="Нет">
          <div class="d-f f-d-c">
            <h3 class="news3Title fs-28px fw-400">Лучшие внедорожники до миллиона рублей - выборка</h3>
            <div class="d-f f-d-r j-c-s-b mt_1 ml-2">
              <h4 class="fs-17px fw-400 c-black">Авто</h4>
              <h4 class="fs-17px fw-400 c-black">Обзоры</h4>
              <h4 class="fs-17px fw-400 c-black">01.11.22</h4>
            </div>
            <h3 class="fs-17px fw-400 ml-2 lh-2">Сегодня мы рассмотрим лучшие внедорожники для российских дорог
              ценой до всего лишь до одного миллиона рублей!</h3>
            <button @click="showNews('news4Info', 'checkNews4')" :disabled="currentNews === 'news4Info'" class="fs-24px fw-400 checkNews4" type="submit">{{ buttonText('checkNews4') }}</button>
        </div>
      </div>
      </div>
    </section>
  </body>
</template>

<script>
export default {
  data() {
    return {
      currentNews: null
    };
  },
  methods: {
    showNews(news) {
      if (this.currentNews !== news) {
        this.currentNews = news;
      }
      else {
        this.currentNews = null;
      }
    },
    buttonText(buttonClass) {
      if (this.currentNews === null) {
        return "Читать далее";
      }
      else if (this.currentNews === 'news3Info' && buttonClass === 'checkNews3') {
        return "Вы уже здесь";
      }
      else if (this.currentNews === 'news4Info' && buttonClass === 'checkNews4') {
        return "Вы уже здесь";
      }
      else {
        return "Читать далее";
      }
    }
  }
};
</script>